# GetSimpleType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..GetSimpleType Method
IFCData Class See Also
---
Gets the IFC type name.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string GetSimpleType()
```

Visual Basic
---
```text
Public Function GetSimpleType As String
```

Visual C++
---
```text
public:
String^ GetSimpleType()
```

# ### Return Value
The name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | No type assigned or it is not a simple type. |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace